#include <iostream>

int main() {
	unsigned n, k;
	std::cin >> n >> k;

	// Тук задачата е сходна като миналата, но няма да правим AND с 1, тъй като не искаме само последния бит
	// Трябва 1 да е отместено с k позиции наляво
	// Това можем да го направим с операцията <<, като я приложим k на брой пъти

	// Пример: (n = 36, k = 5)
	// 000000000100100
	//				  &
	// 000000000100000 <- (1 << 5)
	// ---------------
	// 000000000100000

	unsigned kthBit;
	// Приемаме, че k започва от 0
	if ((n & (1 << k)) > 0) {
		kthBit = 1;
	}
	else kthBit = 0;

	// Или просто:
	//		unsigned kthBit = (n & (1 << k)) > 0

	std::cout << "K-th bit is " << kthBit << std::endl;
}