#include <iostream>

int main() {
	// Когато се работи с побитови операции, трябва променливата да е от тип unsigned или unsigned long long
	unsigned n;
	std::cin >> n;

	// Примери:
	// 
	// 202 & 1 == 0
	// 00000000011001010
	//					&
	// 00000000000000001
	// -----------------
	// 00000000000000000

	// 245 & 1 == 1
	// 00000000011110101
	//					&
	// 00000000000000001
	// -----------------
	// 00000000000000001

	// Извършваме операцията бит по бит, колона по колона в двоичния запис на числото

	// Ако последният бит е 1, искаме да го запазим
	// А ако е 0, искаме да върнем 0
	// Това можем да направим като използваме AND с 1-ца
	// Защото 1 AND 1 си остава 1, а 0 AND 1 дава 0 
	// Останалите битове ще се занулят, защото x AND 0 = 0 независимо от x

	std::cout << "Last bit is " << (n & 1) << std::endl;
}