#include <iostream>

int findMin(int arr[], int arrSize) {
	if (arrSize == 0) throw std::runtime_error("No elements");

	// Променливата minElement ще ни съхранява минималния елемент до текущия момент на обхождане на масива
	// Още преди да почнем да обхождаме, предполагаме, че елементът с индекс 0 е минимален
	
	int minElement = arr[0];
	// Решението щеше да е напълно вярно ако на minElement бяхме присвоили INT_MIN

	// Цикълът може да започва от 1, тъй като няма нужда да проверяваме 0-вия елемент със себе си
	for (int i = 1; i < arrSize; i++) {
		// Когато намерим по-малък елемент от досегашния минимум, ще си обновим променливата, за да отчетем новия минимум
		if (arr[i] < minElement) {
			minElement = arr[i];
		}
	}
	return minElement;
}

int main() {
	// Когато в условието на задача изрично се иска да напишете програмен фрагмент или функция,
	// дали в main-а ще си въвеждате елементи от клавиатурата или ще си hard-code-нете свои числа, няма значение.
	// В такива случаи ще оценяваме само функцията/фрагмента.

	int arr[] = { 1, -5, 2, 0, -6, 7 };
	std::cout << findMin(arr, 6) << std::endl;
}